app/controllers/fixes_controller.rb

  def new
    @issue = Issue.find(params[:issue_id])
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT 1  [["id", 2]]