app/controllers/issues_controller.rb

  def show
    if @issue = Issue.find_by(id: params[:id])
      @address = Geocoder.address("#{@issue.latitude}, #{@issue.longitude}")

      @categories = @issue.categories

      if @categories.empty?

        @category_name = "Uncategorized"

      end

      @fixes = @issue.fixes
      @comments = @issue.issue_comments.map { |comment| comment.package_info }


      @current_user_watching = false
      @current_user = nil

      if user_signed_in?
        @current_user_id = current_user.id
        @current_user = current_user
        if current_user.issues_watches.where(issue_id: @issue.id).size != 0
          @current_user_watching = true
        end
        @current_user_id = current_user.id
      end

      @upvotes = @issue.users_votes.size
---
SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT 1  [["id", 9]]
SELECT  "categories".* FROM "categories" INNER JOIN "categories_issues" ON "categories"."id" = "categories_issues"."category_id" WHERE "categories_issues"."issue_id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["issue_id", 6]]
SELECT  1 AS one FROM "categories" INNER JOIN "categories_issues" ON "categories"."id" = "categories_issues"."category_id" WHERE "categories_issues"."issue_id" = $1 LIMIT 1  [["issue_id", 9]]
SELECT "fixes".* FROM "fixes" WHERE "fixes"."issue_id" = $1  [["issue_id", 9]]
SELECT "issue_comments".* FROM "issue_comments" WHERE "issue_comments"."issue_id" = $1  [["issue_id", 9]]
SELECT COUNT(*) FROM "issues_watches" WHERE "issues_watches"."user_id" = $1 AND "issues_watches"."issue_id" = $2  [["user_id", 5], ["issue_id", 9]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
SELECT COUNT(*) FROM "issues" WHERE "issues"."id" = $1 AND "issues"."user_id" = $2  [["id", 9], ["user_id", 5]]
SELECT COUNT(*) FROM "users_votes" WHERE "users_votes"."issue_id" = $1 AND "users_votes"."user_id" = $2  [["issue_id", 9], ["user_id", 5]]

  def new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    category_id_array = []
    uncategorized_category = Category.where(name: "Uncategorized").first

    if params[:categories]
      params[:categories].each do |category_id|
        category_id_array << category_id[1].to_i
      end
    end

    @issue = Issue.new(issue_params)
    if contains_image?
      @issue.image_url = upload_image
    else
      @issue.image_url = "http://i.imgur.com/xQyE9HC.png"
    end

    @issue.community_id = 1

    if @issue.save
      unless category_id_array.empty?
        category_id_array.each do |category_id|
          category = Category.find(category_id)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["name", "Uncategorized"]]
INSERT INTO "issues" ("title", "description", "latitude", "longitude", "image_url", "community_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]