app/controllers/users_controller.rb

  def show
    @user = User.find_by(id: params[:id])

    @same_user = false

    if user_signed_in?
      if @user.id == current_user.id
        @same_user = true
      end
    end

    @issues = @user.issues.map { |issue| issue.package_info}
    @fixes = @user.fixes.map { |fix| fix.package_info}
    @watches = @user.issues_watches.map { |watches| watches.package_info}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
SELECT "issues".* FROM "issues" WHERE "issues"."user_id" = $1  [["user_id", 5]]
SELECT "fixes".* FROM "fixes" WHERE "fixes"."user_id" = $1  [["user_id", 5]]
SELECT "issues_watches".* FROM "issues_watches" WHERE "issues_watches"."user_id" = $1  [["user_id", 5]]

  def create_watch
    new_watch = IssuesWatch.create(user_id: params["content"]["user_id"], issue_id: params["content"]["issue_id"])
---
INSERT INTO "issues_watches" ("user_id", "issue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["issue_id", 9], ["created_at", "2015-11-14 20:45:56.438596"], ["updated_at", "2015-11-14 20:45:56.438596"]]

  def delete_watch
    watch_to_delete = IssuesWatch.find_by(user_id: params["content"]["user_id"], issue_id: params["content"]["issue_id"])
    watch_to_delete.destroy
---
SELECT  "issues_watches".* FROM "issues_watches" WHERE "issues_watches"."user_id" = $1 AND "issues_watches"."issue_id" = $2 LIMIT 1  [["user_id", 5], ["issue_id", 9]]
DELETE FROM "issues_watches" WHERE "issues_watches"."id" = $1  [["id", 11]]

  def create_vote
    up_vote = UsersVote.create(user_id: params["content"]["user_id"], issue_id: params["content"]["issue_id"])
---
INSERT INTO "users_votes" ("user_id", "issue_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["issue_id", 10], ["created_at", "2015-11-14 17:56:28.326900"], ["updated_at", "2015-11-14 17:56:28.326900"]]

  def delete_vote
    vote_to_delete = UsersVote.find_by(user_id: params["content"]["user_id"].to_i, issue_id: params["content"]["issue_id"].to_i)
    vote_to_delete.destroy
---
SELECT  "users_votes".* FROM "users_votes" WHERE "users_votes"."user_id" = $1 AND "users_votes"."issue_id" = $2 LIMIT 1  [["user_id", 5], ["issue_id", 2]]
DELETE FROM "users_votes" WHERE "users_votes"."id" = $1  [["id", 12]]